#+TITLE: Developing an Application

#+PROPERTY: header-args:haskell :results replace output
#+PROPERTY: header-args:haskell+ :noweb yes
#+PROPERTY: header-args:haskell+ :wrap EXAMPLE

- Designing a standalone multi-module Haskell program with dependencies
- Dealing with dates, text (NOTE: he is obsessed) and command-line arguments
- Parsing CSV files
- Plotting charts
- Employing type classes

** Parsing CSV

#+NAME: quote-data
#+BEGIN_SRC haskell :eval never
data QuoteData = QuoteData {
                   day :: Day, -- from time package
                   volume :: Int,
                   open :: Double,
                   close :: Double,
                   high :: Double,
                   low :: Double
                 }
#+END_SRC

To integrate ~cassava~ and ~time~ with our code, we need to implement the
following type classes:
- ~Generic~ from ~GHC.Generics~ to allow ~cassava~ to work with our data type
  ~QuoteData~.
- ~FromNamedRecord~ to allow ~cassava~ to read a CSV file with named fields and
  map data to the record fields (by matching field name in data file and field
  name in data structure) (ASK: is because of this that he needs ~Generic~?).
- ~FromField~ to teach ~cassava~ how to parse ~Day~ values.

#+BEGIN_SRC haskell :eval never
{-# LANGUAGE DeriveGeneric #-}
{-# LANGUAGE DeriveAnyClass #-}
{-# LANGUAGE StandaloneDeriving #-}

deriving instance Generic QuoteData
deriving instance Generic FromNamedRecord
#+END_SRC

We need to teach ~cassava~ how to parse ~Day~ values defined by ~time~ package,
we will do that by implementing the following type class from ~cassava~ for ~Day~

#+BEGIN_SRC haskell :eval never
class FromField a where
  parseField :: Field -> Parser a
#+END_SRC

NOTE: how can we create a ~Parser Day~ since ~Parser~ is from ~cassava~? Because
~Parser~ implements ~Monad~ (in particular ~MonadFail~), ~parseTimeM~ from
~time~ will return a ~MonadFail~ of anything that implements ~ParseTime~ and
~Day~ does

#+BEGIN_SRC haskell
import Data.Csv
import Data.Time
import Data.ByteString.Char8 (unpack, pack)

:{
instance FromField Day where
  parseField = parseTimeM True defaultTimeLocale "%Y-%m-%d" . unpack
:}

:{
day :: Either String Day
day = runParser $ parseField $ pack "2019-05-01"
:}

:t parseTimeM
day
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
parseTimeM
  :: (MonadFail m, ParseTime t) =>
     Bool -> TimeLocale -> String -> String -> m t
Right 2019-05-01
#+END_EXAMPLE

